export type MegaGroup = { title: string; items: string[] };

export const megaGroups: MegaGroup[] = [
  {
    title: "Пътноремонтна техника",
    items: [
      "Асфалтови рециклатори",
      "Гудронатори",
      "Машини за запълване на пукнатини",
      "Машини за повърхностна обработка",
      "Миксери за битум",
      "Нагреватели за асфалт",
      "Пътно-поддържаща техника",
    ],
  },
  {
    title: "Тежка механизация",
    items: [
      "Булдозери",
      "Радиоуправляеми мулчери",
      "Фрези за асфалт",
      "Багери",
      "Бетонова техника",
      "Валяци",
      "Вишки",
    ],
  },
  {
    title: "Лека механизация",
    items: [
      "ВиК",
      "Осветителни кули",
      "Триони",
      "Бетон и уплътнение",
      "Авто и мото",
      "Генератори",
      "Градински и горски",
    ],
  },
  {
    title: "Строително оборудване",
    items: [
      "Обработка на материали",
      "Транспортни ленти",
      "Скелета",
      "Асансьори и подемници",
      "Кофраж",
      "Кранове и кюбели",
      "Мобилно скеле",
    ],
  },
  {
    title: "Комунални машини",
    items: [
      "Миене на улици",
      "Оборудване за ферми",
      "Разпръсквачи на течни агенти",
      "Снегопочистващи",
      "Сметоизвозващ",
      "Водоноска",
      "Каналопочистваща",
    ],
  },
  {
    title: "Индустриални машини",
    items: [
      "Автокранове",
      "Вакуумни хващачи",
      "Индустриални асансьори",
      "Кранове",
      "Машини за полагане на кабели",
      "Машини за полагане на оптични кабели",
      "Почистване на соларни панели",
    ],
  },
  {
    title: "Селскостопанска техника",
    items: ["Помпи", "Скрепери", "Трактори", "Култиватори", "Плугове", "Пръскачки", "Торачки"],
  },
];
